//Задача 2:

Console.WriteLine("Ведите число");

int a = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Ведите второе чилсло");

int b = Convert.ToInt32(Console.ReadLine());

if (a > b)

System.Console.WriteLine( + a + b);

else System.Console.WriteLine($"Большее число: {a}, меньшее число: {b}");